Other/research.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='https://cdn.simplecss.org/simple.min.css' />
   <link rel='stylesheet' type='text/css' href='../css/tech-notes-site.css' />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../"> HOME </a>
</div><nil id="nil" class="content">
<section id="outline-container-orgb887bc5" class="outline-2">
<h2 id="orgb887bc5">What are Large Language Models (LLMs)</h2>
<div class="outline-text-2" id="text-orgb887bc5">
<p>
Large, general-purpose language models can be pre-trained and then fine-tuned
for specific purposes.
</p>

<p>
Source: <a href="https://www.youtube.com/watch?v=zizonToFXDs">Introduction to Large Language Models by Goodle</a>.
</p>
</div>
</section>


<section id="outline-container-orgcde215e" class="outline-2">
<h2 id="orgcde215e">Marqo.ai</h2>
<div class="outline-text-2" id="text-orgcde215e">
<p>
<b>What is tensor search?</b>
</p>

<p>
Tensor search uses deep-learning to transform documents, images and other data into collections of vectors called “tensors”. Representing data as tensors allows us to match queries against documents with human-like understanding of the query and document’s content. Tensor search can power a variety of use cases such as:
</p>

<ul class="org-ul">
<li>end user search and recommendations</li>
<li>multi-modal search (image-to-image, text-to-image, image-to-text)</li>
<li>chat bots and question and answer systems</li>
<li>text and image classification</li>
</ul>
</div>
</section>


<section id="outline-container-org0468cd1" class="outline-2">
<h2 id="org0468cd1">LLM-150</h2>
<div class="outline-text-2" id="text-org0468cd1">
</div>
<div id="outline-container-org69ed3c3" class="outline-3">
<h3 id="org69ed3c3">Some References</h3>
<div class="outline-text-3" id="text-org69ed3c3">
<ul class="org-ul">
<li><a href="https://raffaeu.medium.com/generate-an-amazon-s3-pre-signed-url-with-aws-lambda-and-amazon-api-gateway-4ffbea99207d">https://raffaeu.medium.com/generate-an-amazon-s3-pre-signed-url-with-aws-lambda-and-amazon-api-gateway-4ffbea99207d</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgecb5e20" class="outline-3">
<h3 id="orgecb5e20">CANCELED Create cdk project</h3>
<div class="outline-text-3" id="text-orgecb5e20">
<p>
<a href="https://github.com/aws-samples/aws-cdk-examples/blob/master/typescript/rekognition-lambda-s3-trigger/lib/rekognition-lambda-s3-trigger-stack.ts">https://github.com/aws-samples/aws-cdk-examples/blob/master/typescript/rekognition-lambda-s3-trigger/lib/rekognition-lambda-s3-trigger-stack.ts</a>
</p>
</div>
</div>

<div id="outline-container-org43a184b" class="outline-3">
<h3 id="org43a184b"><span class="done DONE">DONE</span> Create an s3 bucket</h3>
<div class="outline-text-3" id="text-org43a184b">
<p>
Create a lambda that triggers on s3 bucket creation
</p>
</div>
</div>

<div id="outline-container-org680affc" class="outline-3">
<h3 id="org680affc"><span class="done DONE">DONE</span> Create Lambda with Python</h3>
<div class="outline-text-3" id="text-org680affc">
</div>
</div>

<div id="outline-container-org7f9048a" class="outline-3">
<h3 id="org7f9048a"><span class="done DONE">DONE</span> Receive document from s3 bucket</h3>
<div class="outline-text-3" id="text-org7f9048a">
</div>
</div>

<div id="outline-container-orgd2c521c" class="outline-3">
<h3 id="orgd2c521c"><span class="done DONE">DONE</span> Get chunks of document</h3>
<div class="outline-text-3" id="text-orgd2c521c">
</div>
</div>

<div id="outline-container-org3ad74df" class="outline-3">
<h3 id="org3ad74df">INPROGRESS integrate marqo</h3>
</div>

<div id="outline-container-orgcdce7fe" class="outline-3">
<h3 id="orgcdce7fe">INPROGRESS upload document chunks to marqo</h3>
<div class="outline-text-3" id="text-orgcdce7fe">
<p>
For the indexing I thought I can get the folder path of the file where we can have somo sort of hierarchy like:
</p>

<ul class="org-ul">
<li><p>
<code>businnes_unit/group-id[user-id]/*</code>
</p>

<p>
translated that would be something like:
</p></li>
<li><p>
<code>stat/organization[user or domain or group?])/file.pdf</code>
</p>

<p>
So I need to create the name of the index taking into account those params.
</p>

<ul class="org-ul">
<li>bussiness unit</li>
<li>group</li>
</ul></li>
</ul>


<p>
Constraints:
</p>

<ul class="org-ul">
<li>filename must not have &rsquo;<code>+</code>&rsquo; chars, because if the file has blanks, S3 changes it to <code>+</code> chars.</li>
</ul>


<p>
<code>Josue1:9BeBrave</code>
</p>
</div>
</div>
</section>
</nil>
<footer id="postamble" class="status">

<div class='footer'>
Copyright © 2022 <a href='mailto:aang.drummer@gmail.com'>Abel Güitian</a> | <a href='https://github.com/aang7/aang7.github.io'>Source</a><br>
Last updated on Aug 29, 2025 using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15) <br>
</div>
</footer>
</body>
</html>
